tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
/*********************************************************************
 * INCLUDES
 */
#include <stdlib.h>
#include "app_cfg.h"

#ifdef ENABLE_SOFTWARE_TO_TDX
#include "tdxinfoservice.h"
#include "rledecode.h"
#include "commoninfo.h"
#include "aes_util.h"
#include "base64.h"
#include "img_perf.h"
#include "flash_api.h"
#include "util.h"
#include "epd_driver.h"
#include "flash_driver.h"
#include "zlib_image_codec.h"
#include "zlib_image_store.h"
#include "tdx_image_stream.h"
#include "ch583_secure.h"
#include "release_trace.h"

/*********************************************************************
 * MACROS
 */

/*********************************************************************
 * UTILITY FUNCTIONS
 */

/**
 * 将 5 个 ASCII(49–126) 字符压缩为 4 字节的 uint32_t
 *
 * 原理：
 * - 每个字符映射到 0–77
 * - 把 5 个"78 进制位"合成为一个 32 位无符号整数
 *
 * @param str        输入字符串，必须至少有 5 个字符
 * @param out_value  输出uint32_t值的指针
 * @return 0 成功，-1 表示错误（非法字符）
 */
static int encode5To4Bytes(const char str[5], uint32_t *out_value) {
    uint32_t value = 0;

    for (int i = 0; i < 5; i++) {
        unsigned char c = (unsigned char)str[i];

        if (c < 49 || c > 126) {
            return -1; // 非法字符
        }

        // 相当于 78 进制左移一位
        value = value * 78 + (uint32_t)(c - 49);
    }

    // 输出最终的32位值（大端序）
    *out_value = value;

    return 0;
}

/**
 * 核心函数：验证接收到的user_id是否与flash中存储的匹配
 * 通用接口，所有场景都可以复用
 *
 * @param received_user_id  接收到的4字节user_id
 * @return 0 验证通过或跳过验证，-1 验证失败
 */
static int verifyUserId(uint32_t received_user_id) {
    // 检查flash中是否有user_id（非全0/全F则有）
    uint32_t stored_user_id = getUserId();
    if(stored_user_id == 0x00000000 || stored_user_id == 0xFFFFFFFF){
        // flash中无user_id，跳过验证
        return 0;
    }
    
    // flash中有user_id，需要验证
    if(received_user_id != stored_user_id){
        PRINT("User_id mismatch! (Recv:0x%08X != Stored:0x%08X)\n", received_user_id, stored_user_id);
        return -1;
    }
    
    return 0;
}

/**
 * 验证数据中的user_id是否与flash中存储的匹配
 * 用于广播场景，user_id在%后面的5个ASCII字符
 * 兼容旧广播指令：如果没有%，默认user_id为0
 *
 * @param data              数据缓冲区
 * @param dataLen           数据长度
 * @param search_start_pos  开始搜索%的位置（通常是前缀长度）
 * @return 0 验证通过或跳过验证，-1 验证失败
 */
static int verifyUserIdInData(UINT8 *data, UINT32 dataLen, int search_start_pos) {
    // 查找 '%' 的位置
    int percent_pos = -1;
    for(int i = search_start_pos; i < dataLen; i++){
        if(data[i] == '%'){
            percent_pos = i;
            break;
        }
    }
    
    uint32_t received_user_id = 0x00000000;  // 默认为0（兼容旧指令）
    
    // 如果找到%，提取并编码user_id
    if(percent_pos >= 0){
        // 验证%后面至少有5个字符
        if((dataLen - percent_pos - 1) < 5){
            PRINT("Broadcast format error: insufficient user_id length\n");
            return -1;
        }
        
        // 提取并编码user_id（%后面的5个字符）
        char user_id_str[5];
        memcpy(user_id_str, &data[percent_pos + 1], 5);
        
        // 编码并转换为uint32_t
        if(encode5To4Bytes(user_id_str, &received_user_id) != 0){
            PRINT("Broadcast format error: invalid user_id characters\n");
            return -1;
        }
    }
    
    // 调用核心验证函数
    return verifyUserId(received_user_id);
}

/**
 * 处理user_id验证和lock标志
 *
 * @param received_user_id  从蓝牙接收到的user_id
 * @param lock              lock标志（1=锁定，0=不锁定）
 * @return 0 成功继续，-1 拒绝操作
 */
static int processUserIdAndLock(uint32_t received_user_id, uint8_t lock) {
    // 从flash读取当前存储的user_id
    uint32_t stored_user_id = getUserId();
    
    // 判断flash中的user_id是否为全0或全F（未初始化状态）
    if(stored_user_id == 0x00000000 || stored_user_id == 0xFFFFFFFF){
        // 情况1：flash中user_id未初始化（全0或全F）
        if(lock == 1){
            // lock=1：将接收到的user_id存入flash
            setUserId(received_user_id);
            PRINT("User ID saved: 0x%08X\r\n", received_user_id);
        }
        return 0;  // 继续刷图流程
    }
    
    // 情况2：flash中user_id已有值（非全0，非全F）
    // 先比对user_id是否一致
    if(received_user_id != stored_user_id){
        // user_id不一致，拒绝操作
        PRINT("User ID mismatch! (Recv:0x%08X != Stored:0x%08X) Rejected.\r\n", 
              received_user_id, stored_user_id);
        return -1;
    }
    
    // user_id一致，继续判断lock
    if(lock == 0){
        // lock=0：擦除flash中的user_id（写全0）
        clearUserId();
        PRINT("User ID cleared\r\n");
    }
    
    return 0;  // 继续刷图流程
}

/**
 * 验证广播消息的user_id并解析参数
 *
 * @param adData             广播数据
 * @param dataLen            广播数据长度
 * @param out_room           输出room编号
 * @param out_group          输出group编号
 * @param out_screen_mode    输出屏幕模式字符（仅用于G命令）
 * @param out_param_count    输出参数个数（0/1/2/3）
 * @return 0 成功，-1 失败（格式错误或user_id不匹配）
 */
static int verifyBroadcastAndParseParams(UINT8 *adData, UINT32 dataLen, 
                                         uint8_t *out_room, uint8_t *out_group, 
                                         uint8_t *out_screen_mode, int *out_param_count) {
	// 验证user_id（广播格式：前4字节是命令前缀，从第4字节开始搜索%）
	if(verifyUserIdInData(adData, dataLen, 4) != 0){
		return -1;
	}
	
	// 查找 '%' 的位置（用于分隔room/group和user_id）
	int percent_pos = -1;
	for(int i = 4; i < dataLen; i++){
		if(adData[i] == '%'){
			percent_pos = i;
			break;
		}
	}
	if(percent_pos == -1)
	{
		percent_pos = dataLen;
	}
	// 解析room、group和屏幕模式（#和%之间的字符）
	int param_count = percent_pos - 4;  // #后面到%之前的字符数
	*out_param_count = param_count;
	*out_room = 0;
	*out_group = 0;
	*out_screen_mode = 0;
	
	if(param_count == 0){
		// 没有room/group参数（格式：D@!#%xxxxx）
		PRINT("No room/group specified\n");
	}else if(param_count == 1){
		// 只有room（1位数字，格式：D@!#1%xxxxx）
		*out_room = adData[4] - 33;
		PRINT("Room only: %d\n", *out_room);
	}else if(param_count == 2){
		// room + group（2位数字，格式：D@!#12%xxxxx）
		*out_room = adData[4] - 33;
		*out_group = adData[5] - 33;
		PRINT("Room: %d, Group: %d\n", *out_room, *out_group);
	}else if(param_count == 3){
		// room + group + 屏幕模式（3位，格式：G@!#11C%xxxxx，用于G命令）
		//兼容旧协议的C指令，C@!#111清除第一会议室
		*out_room = adData[4] - 33;
		*out_group = adData[5] - 33;
		*out_screen_mode = adData[6];  // 第三位是屏幕模式字符（'a', 'b', 'C'等）
		PRINT("Room: %d, Group: %d, Screen mode: %c\n", *out_room, *out_group, *out_screen_mode);
	}else{
		PRINT("Invalid param format (too many chars: %d)\n", param_count);
		return -1;
	}
	
