tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
	return 0;
}

/*********************************************************************
 * CONSTANTS
 */
struct _TDX_AES_INFO global_TDX_AES_INFO;
struct _TDX_AES_DATA_INFO global_TDX_AES_DATA_INFO;
uint8 	gVerM;
uint8 	gVerS;
uint8 	gScreenType;
uint8 	IsDecryptFlag = Is_No;
uint8_t data_aes_key[16] = {0};
/*********************************************************************
 * TYPEDEFS
 */

//#define FALSH_TEST_DEBUG
/*********************************************************************
 * GLOBAL VARIABLES
 */
// Tdx information service
const uint8_t tdxInfoSerUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x00,0xff,0x12,0x7b};

// 1 get adc ID
const uint8_t tdxInfoGetInfoUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x01,0xff,0x12,0x7b};

// 2 get ver
const uint8_t tdxInfoGetVerUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x02,0xff,0x12,0x7b};

// 3 send data
const uint8_t tdxnfoSendDataUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x03,0xff,0x12,0x7b};

// 4  Bind
const uint8_t tdxInfoBindUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x04,0xff,0x12,0x7b};

// 5 send aes iv
const uint8_t tdxInfoSendAesIvUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x05,0xff,0x12,0x7b};

// 6 bind iv
const uint8_t tdxInfoBindIvUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x06,0xff,0x12,0x7b};

// 7 send aes key
const uint8_t tdxInfoSendAesKeyUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x07,0xff,0x12,0x7b};

// 8 send phone id
const uint8_t tdxInfoSendPhoneIdUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x08,0xff,0x12,0x7b};

// 9 get board model
const uint8_t tdxInfoGetBoardModelUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x09,0xff,0x12,0x7b};

// 10 notify dev
const uint8_t tdxInfoNotifyDevUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x10,0xff,0x12,0x7b};

// 11 notify ota 
const uint8_t tdxInfoNotifyOtaUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x11,0xff,0x12,0x7b};

// 12 pre save 
const uint8_t tdxInfoSendPreSaveUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x12,0xff,0x12,0x7b};

// 13 clean screen 
const uint8_t tdxInfoSendCleanUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x13,0xff,0x12,0x7b};

// 14 switch work mod 
const uint8_t tdxInfoSwitchModeUUID[ATT_UUID_SIZE] = {
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x14,0xff,0x12,0x7b};

/*********************************************************************
 * EXTERNAL VARIABLES
 */
/*********************************************************************
 * EXTERNAL FUNCTIONS
 */
int InitFirstPackage(uint16 connHandle);
int InitOtherPackage(uint16 connHandle, UINT8 *adData, UINT32 dataLen);
void notitySendEnd(uint16 connHandle, uint8 status, uint8 type, uint8_t *out_buf, uint16_t *out_len);
void notitySendFunc(uint16 connHandle, uint8_t *out_buf, uint16_t *out_len);
void notifyDeviceBound(uint16 connHandle);
void TdxInfo_ClearDisplayBusyProtect(void);

/*********************************************************************
 * LOCAL VARIABLES
 */
static uint8_t s_tdx_display_busy_protect = 0;
static uint32_t s_tdx_busy_drop_packets = 0;
static uint16 s_refresh_notify_conn;
static uint8 s_refresh_notify_type;
static uint8 s_refresh_notify_count;
static uint8 s_refresh_notify_pending;
static uint8 s_refresh_notify_trace;
static uint8 s_refresh_notify_rx_valid;
static UINT32 s_refresh_notify_rx_ticks;
static uint8 s_large_refresh_log_pending;
static uint8 s_large_refresh_log_started;

static UINT32 refresh_notify_elapsed_ms(void)
{
    UINT32 now = RTC_GetCycle32k();
    UINT32 ticks = now >= s_refresh_notify_rx_ticks ?
                   now - s_refresh_notify_rx_ticks :
                   RTC_MAX_COUNT - s_refresh_notify_rx_ticks + now;
    return (ticks / CAB_LSIFQ) * 1000U +
           ((ticks % CAB_LSIFQ) * 1000U) / CAB_LSIFQ;
}

/*********************************************************************
 * Profile Attributes - variables
 */

// tdx Information Service attribute
static const gattAttrType_t tdxInfoSer = {ATT_UUID_SIZE, tdxInfoSerUUID};

//1 get info
static uint8_t tdxInfoGetInfoProps = GATT_PROP_NOTIFY;
static gattCharCfg_t tdxInfoGet_cccd[4];

//2 get ver
static uint8_t tdxInfoGetVerProps = GATT_PROP_READ;

//3 send data
static uint8_t tdxnInfoSendDataProps = GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;

//4 Bind
static uint8_t tdxInfoBindProps = GATT_PROP_NOTIFY;
static gattCharCfg_t tdxInfoBind_cccd[4];

//5 send aes iv
static uint8_t tdxInfoSendAesIvProps = GATT_PROP_WRITE;

//6 bind iv
static uint8_t tdxInfoBindIvProps = GATT_PROP_NOTIFY;
static gattCharCfg_t tdxInfoBindIv_cccd[4];

//7 send aes key
static uint8_t tdxInfoSendAesKeyProps = GATT_PROP_WRITE;

//8 send phone id
static uint8_t tdxInfoSendPhoneIdProps = GATT_PROP_WRITE;

//9 get board model
static uint8_t tdxInfoGetBoardModelProps = GATT_PROP_READ;

// 10 notify dev
static uint8_t tdxInfoNotifyDevProps = GATT_PROP_READ | GATT_PROP_WRITE;

// 11 notify ota
static uint8_t tdxInfoNotifyOtaProps = GATT_PROP_READ | GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;//GATT_PROP_READ | GATT_PROP_WRITE;//

//12 presave 
static uint8_t tdxInfoSendPreSaveProps = GATT_PROP_NOTIFY | GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;

//13 clean 
static uint8_t tdxInfoSendCleanProps = GATT_PROP_WRITE;

//14 switch 
static uint8_t tdxInfoSwitchModeProps = GATT_PROP_READ | GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;

static gattCharCfg_t tdxInfoPreSave_cccd[4];

/*********************************************************************
 * Profile Attributes - Table
 */
static gattAttribute_t tdxInfoAttrTbl[] = {
    // Device Information Service index0
    {
        {ATT_BT_UUID_SIZE, primaryServiceUUID}, /* type */
        GATT_PERMIT_READ,                       /* permissions */
        0,                                      /* handle */
        (uint8_t *)&tdxInfoSer              	/* pValue */
    },
    
