tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
#if 0
    //CHAR 2 ,tdxInfoGetAdcUUID
    // System ID Declaration index1
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoGetAdcProps
    },

    // System ID Value index2
    {
        {ATT_UUID_SIZE, tdxInfoGetAdcUUID},
        GATT_PERMIT_READ,
        0,
        NULL
    },
#endif
#if 1
    //CHAR 6,boeInfoBindUUID
    // System ID Declaration index1
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoGetInfoProps
    },

    // System ID Value index2
    {
        {ATT_UUID_SIZE, tdxInfoGetInfoUUID},
        0,
        0,
        NULL
    },
    { //index3
        { ATT_BT_UUID_SIZE, clientCharCfgUUID },
        GATT_PERMIT_READ|GATT_PERMIT_WRITE,
        0,
        (uint8*)tdxInfoGet_cccd
    },
#endif

#if 1
    //CHAR 3,tdxInfoGetVerUUID
    // System ID Declaration  index4
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoGetVerProps
    },

    // System ID Value index5
    {
        {ATT_UUID_SIZE, tdxInfoGetVerUUID},
        GATT_PERMIT_READ,
        0,
        NULL
    },
#endif

#if 1
    //CHAR 5,tdxnfoSendDataUUID
    // System ID Declaration index6
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxnInfoSendDataProps
    },

    // System ID Value index7
    {
        {ATT_UUID_SIZE, tdxnfoSendDataUUID},
        GATT_PERMIT_WRITE,
        0,
        NULL
    },
#endif

#if 1
    //CHAR 6,tdxInfoBindUUID
    // System ID Declaration index8
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoBindProps
    },

    // System ID Value index9
    {
        {ATT_UUID_SIZE, tdxInfoBindUUID},
        0,
        0,
        NULL
    },
    
    { //index10
        { ATT_BT_UUID_SIZE, clientCharCfgUUID },
        GATT_PERMIT_READ|GATT_PERMIT_WRITE,
        0,
        (uint8*)tdxInfoBind_cccd
    },
#endif

#if 1
    //CHAR 7,tdxInfoSendAesIvUUID
    // System ID Declaration index11
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoSendAesIvProps
    },

    // System ID Value index12
    {
        {ATT_UUID_SIZE, tdxInfoSendAesIvUUID},
        GATT_PERMIT_WRITE,
        0,
        NULL
    },
#endif

#if 1
    //CHAR 8,tdxInfoBindIvUUID
    // System ID Declaration index13
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoBindIvProps
    },

    // System ID Value index14
    {
        {ATT_UUID_SIZE, tdxInfoBindIvUUID},
        0,
        0,
        NULL
    },
    { //index 15
        { ATT_BT_UUID_SIZE, clientCharCfgUUID },
        GATT_PERMIT_READ|GATT_PERMIT_WRITE,
        0,
        (uint8*)tdxInfoBindIv_cccd
    },
#endif

#if 1
    //CHAR 9,tdxInfoSendAesKeyUUID
    // System ID Declaration index16
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoSendAesKeyProps
    },

    // System ID Value index17
    {
        {ATT_UUID_SIZE, tdxInfoSendAesKeyUUID},
        GATT_PERMIT_WRITE,
        0,
        NULL
    },
#endif

#if 1
    //CHAR 10,tdxInfoSendPhoneIdUUID
    // System ID Declaration index18
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoSendPhoneIdProps
    },

    // System ID Value index19
    {
        {ATT_UUID_SIZE, tdxInfoSendPhoneIdUUID},
        GATT_PERMIT_WRITE,
        0,
        NULL
    },
#endif

#if 1
    //CHAR 11,tdxInfoGetBoardModelUUID
    // System ID Declaration index20
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &tdxInfoGetBoardModelProps
    },

    // System ID Value index21
    {
        {ATT_UUID_SIZE, tdxInfoGetBoardModelUUID},
        GATT_PERMIT_READ,
        0,
        NULL
    },
#endif

#if 1
    //CHAR 14,tdxInfoNotifyDevUUID
    // System ID Declaration index22
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ|GATT_PERMIT_WRITE,
        0,
        &tdxInfoNotifyDevProps
    },

    // System ID Value 23
    {
        {ATT_UUID_SIZE, tdxInfoNotifyDevUUID},
        GATT_PERMIT_READ|GATT_PERMIT_WRITE,
        0,
        NULL
    },
#endif

#if 1
	//CHAR 6,tdxInfoBindOta
	// System ID Declaration index24
	{
		{ATT_BT_UUID_SIZE, characterUUID},
		GATT_PERMIT_READ|GATT_PERMIT_WRITE,
		0,
		&tdxInfoNotifyOtaProps
	},
	
	// System ID Value index25
	{
		{ATT_UUID_SIZE, tdxInfoNotifyOtaUUID},
		GATT_PERMIT_READ|GATT_PERMIT_WRITE,
		0,
		NULL
	},
#endif

#if 1
	//CHAR 15,tdxInfoSendPreSaveUUID
	// System ID Declaration index26
	{
		{ATT_BT_UUID_SIZE, characterUUID},
		GATT_PERMIT_READ|GATT_PERMIT_WRITE,
		0,
		&tdxInfoSendPreSaveProps
	},

	// System ID Value index27
	{
		{ATT_UUID_SIZE, tdxInfoSendPreSaveUUID},
		GATT_PERMIT_READ|GATT_PERMIT_WRITE,
		0,
		NULL
	},

	{ //index28
		{ ATT_BT_UUID_SIZE, clientCharCfgUUID },
		GATT_PERMIT_READ|GATT_PERMIT_WRITE,
		0,
		(uint8*)tdxInfoPreSave_cccd
	},
#endif

#if 1
	//CHAR 16,tdxInfoSendPreSaveUUID
	// System ID Declaration index29
	{
		{ATT_BT_UUID_SIZE, characterUUID},
		GATT_PERMIT_READ,
		0,
		&tdxInfoSendCleanProps
	},

	// System ID Value index30
	{
		{ATT_UUID_SIZE, tdxInfoSendCleanUUID},
		GATT_PERMIT_WRITE,
		0,
		NULL
	},
#endif

#if 1
	//CHAR 16,tdxInfoSwitchModeProps
	// System ID Declaration index30
	{
		{ATT_BT_UUID_SIZE, characterUUID},
		GATT_PERMIT_READ|GATT_PERMIT_WRITE,
		0,
		&tdxInfoSwitchModeProps
	},

	// System ID Value index31
	{
		{ATT_UUID_SIZE, tdxInfoSwitchModeUUID},
		GATT_PERMIT_READ|GATT_PERMIT_WRITE,
		0,
		NULL
	},
#endif
};

/*********************************************************************
 * LOCAL FUNCTIONS
 */
static bStatus_t tdxInfo_ReadAttrCB(uint16_t connHandle, gattAttribute_t *pAttr,
                                    uint8_t *pValue, uint16_t *pLen, uint16_t offset, uint16_t maxLen, uint8_t method);
static bStatus_t tdxInfo_WriteAttrCB( uint16 connHandle, gattAttribute_t *pAttr,
                                      uint8 *pValue, uint16 len, uint16 offset,uint8 method );
bStatus_t ble_send_tdxInfo( uint16_t connHandle, uint8_t *data, uint16_t length, uint8_t id,  gattCharCfg_t *tdxInfo_cccd);
/*********************************************************************
 * PROFILE CALLBACKS
 */
// Tdx Info Service Callbacks
gattServiceCBs_t tdxInfoCBs = {
    tdxInfo_ReadAttrCB, // Read callback function pointer
    tdxInfo_WriteAttrCB,               // Write callback function pointer
    NULL                // Authorization callback function pointer
};

static int phoneid_len = 0;
static unsigned char u8IsFirstPackage = TDX_DATA_FIRST;
static UINT8 s_zlib_image_active = 0;
static UINT8 s_zlib_image_aborted = 0;
#if TDX_SMALL_STREAM_ENABLE
static TDX_IMAGE_MODE s_image_session_mode = TDX_IMAGE_LARGE_FLASH;
static UINT8 s_small_stream_aborted = 0;
static UINT8 s_small_stream_gate_logged = 0;
static UINT8 s_small_stream_trace_logged = 0;
#endif
#if !TDX_STORE_ZLIB
static int zlib_flash_sink(void *context, const UINT8 *data, UINT16 length)
{
    (void)context;
    save256DataToExternFlashTmp((UINT8 *)data, length, global_EXTERN_FLASH_INFO.fImageIndex, global_EXTERN_FLASH_INFO.fBlockNum);
    return 0;
}
#endif
static void zlib_receive_fail(uint16 connHandle)
{
    if(s_zlib_image_aborted) return;
    s_zlib_image_aborted = 1;
    TdxInfo_CancelRefreshNotify();
    IP_Stop(1);
    uint8_t notify_buf[6]; uint16_t notify_len = 0;
    TRANSFER_LOG_TEXT("ZLIB aborted\r\n");
    FAULT_LOG_TEXT("FAULT img transfer aborted\r\n");
#if TDX_STORE_ZLIB
    zlib_image_store_abort();
#else
    zlib_image_codec_abort();
#endif
    s_zlib_image_active = 0;
    global_DEVICE_STATUS.fDataSendSuccess = Is_No; global_DEVICE_STATUS.fPackageCnt = 0;
    global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
    u8IsFirstPackage = TDX_DATA_FIRST; IsDecryptFlag = Is_No; DeInitFlashDriver();
    notitySendEnd(connHandle, 0x04, global_TDX_AES_DATA_INFO.fScreenType, notify_buf, &notify_len);
    notitySendFunc(connHandle, notify_buf, &notify_len);
}

/*********************************************************************
 * NETWORK LAYER CALLBACKS
 */

/*********************************************************************
 * PUBLIC FUNCTIONS
 */
static void TdxInfo_HandleConnStatusCB ( uint16 connHandle, uint8 changeType )
{
    // Make sure this is not loopback connection
    if ( connHandle != LOOPBACK_CONNHANDLE )
    {
        // Reset Client Char Config if connection has dropped
        if ( ( changeType == LINKDB_STATUS_UPDATE_REMOVED )      ||
                ( ( changeType == LINKDB_STATUS_UPDATE_STATEFLAGS ) &&
                  ( !linkDB_Up( connHandle ) ) ) )
        {
            TdxInfo_CancelRefreshNotify();
            //ble_uart_TxCCCD[0].value = 0;
            GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoBind_cccd );
            GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoBindIv_cccd );
			GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoPreSave_cccd );
			GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoGet_cccd );
        }
    }
}

/*********************************************************************
 * @fn      TdxInfo_AddService
 *
 * @brief   Initializes the Device Information service by registering
 *          GATT attributes with the GATT server.
 *
 * @return  Success or Failure
 */
bStatus_t CustomerInfo_AddService(void)
{
    uint8_t ret;

    GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoBind_cccd );
    GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoBindIv_cccd );
	GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoPreSave_cccd );
	GATTServApp_InitCharCfg( INVALID_CONNHANDLE, tdxInfoGet_cccd );

