tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
    // Register with Link DB to receive link status change callback
    linkDB_Register( TdxInfo_HandleConnStatusCB  );

    // Register GATT attribute list and CBs with GATT Server App
    ret =  GATTServApp_RegisterService(tdxInfoAttrTbl,
                                       GATT_NUM_ATTRS(tdxInfoAttrTbl),
                                       GATT_MAX_ENCRYPT_KEY_SIZE,
                                       &tdxInfoCBs);
    //PRINT("ADD tdx service:%02x\r\n",ret);
    return ret;
}

/*********************************************************************
 * @fn          tdxInfo_ReadAttrCB
 *
 * @brief       Read an attribute.
 *
 * @param       connHandle - connection message was received on
 * @param       pAttr - pointer to attribute
 * @param       pValue - pointer to data to be read
 * @param       pLen - length of data to be read
 * @param       offset - offset of the first octet to be read
 * @param       maxLen - maximum length of data to be read
 *
 * @return      Success or Failure
 */
static bStatus_t tdxInfo_ReadAttrCB(uint16_t connHandle, gattAttribute_t *pAttr,
                                    uint8_t *pValue, uint16_t *pLen, uint16_t offset, uint16_t maxLen, uint8_t method)
{
    bStatus_t status = SUCCESS;

    uint16_t gatt_handle = pAttr->handle - tdxInfoAttrTbl[0].handle;
    //PRINT("read gatt handle:%08x\r\n",gatt_handle);
    switch (gatt_handle) {
		case TDXINFO_NOTITY_SEND_END:{
			//PRINT("ReadAttrCB TDXINFO_NOTITY_SEND_END 0000000000000000000\r\n");
			uint8_t send_status = (global_DEVICE_STATUS.fDataSendSuccess == Is_Yes) ? 0x01 : 0x00;

			uint8_t notify_buf[6];  // ���������㹻�������ַ�֧����󳤶�6��
    		uint16_t notify_len = 0;  // ��ʼ�����ȱ���
			notitySendEnd(connHandle, send_status, global_TDX_AES_DATA_INFO.fScreenType, notify_buf, &notify_len);

			// �������ݵ�pValue��ʹ����ȷ�ĳ���notify_len��
		    // ��ȫУ�飺����pValue/pLenΪ�գ��򳤶ȳ�������������
		    if (pValue != NULL && pLen != NULL && notify_len <= sizeof(notify_buf)) {
		        memcpy(pValue, notify_buf, notify_len);
		        *pLen = notify_len;
		    } else {
		        // ������������־��ӡ������Ĭ��ֵ
		        *pLen = 0;
		    }
			break;
		}
		case TDXINFO_OTA_INFO:{
			//PRINT("ReadAttrCB TDXINFO_OTA_INFO 0000000000000000000 fOtaStatus:%d\r\n",global_DEVICE_STATUS.fOtaStatus);
			uint8_t ota_data[] = {0};
			ota_data[0] = global_DEVICE_STATUS.fOtaStatus;
			memcpy(pValue,ota_data,1);
			*pLen = 1;
			break;
		}
		case TDXINFO_SWITCH_MODE:{
			uint8_t mode[] = {0};
			uint8_t mode1[] = {0};
			Get_EEPROM_Flag(mode,WORKMODE_Position,WORKMODE_Len);
			//PRINT("ReadAttrCB TDXINFO_SWITCH_MODE 0000000000000000 mode:%d\r\n",mode[0]);
			if(mode[0] == DEVICE_MODE_HIGH){
				mode1[0] = 1;
			}
			else{
				mode1[0] = 0;
			}
			memcpy(pValue,mode1,WORKMODE_Len);
            *pLen = WORKMODE_Len;
		}
		break;
        default:

            break;
    }
    return (status);
}

void DataCallBack(unsigned char *data, int length) {
	int i;
	unsigned char PREFIXSTR[5] = {0x42,0x4f,0x45,0x44,0x54};
	unsigned char phoneid[PBONE_ID_LENGTH];

	memcpy(global_TDX_AES_INFO.szAesKey,data,16);
	phoneid_len = length-21;
	memcpy(phoneid,data+21,phoneid_len);
	//hex_dump(phoneid, phoneid_len);
	Get_EEPROM_Flag(global_TDX_AES_INFO.szPhoneId,PHONEID_Position,PHONEID_Len);

	if (strncmp(global_TDX_AES_INFO.szPhoneId, phoneid, phoneid_len) == 0){
		global_DEVICE_STATUS.fIsBonded[0] = DEVICE_BONDED;
	}else{
		memcpy(global_TDX_AES_INFO.szPhoneId,phoneid,phoneid_len);
		Save_EEPROM_Flag(global_TDX_AES_INFO.szPhoneId,PHONEID_Position,PHONEID_Len);
		//hex_dump(global_TDX_AES_INFO.szPhoneId, phoneid_len);
		global_DEVICE_STATUS.fIsBonded[0] = DEVICE_BONDED;
	}
	Save_EEPROM_Flag(global_DEVICE_STATUS.fIsBonded,BONDED_Position,BONDED_Len);
	P_scanBondRspData(global_DEVICE_STATUS.fIsBonded[0]);
}

static bStatus_t tdxInfo_WriteAttrCB( uint16 connHandle, gattAttribute_t *pAttr,
                                      uint8 *pValue, uint16 len, uint16 offset,uint8 method )
{
	int i, ret;
    bStatus_t status = SUCCESS;
    //uint8 notifyApp = 0xFF;
    // If attribute permissions require authorization to write, return error
    if ( gattPermitAuthorWrite( pAttr->permissions ) )
    {
        // Insufficient authorization
        return ( ATT_ERR_INSUFFICIENT_AUTHOR );
    }

	global_DEVICE_STATUS.fisHaveData= Is_Yes;
    uint16_t gatt_handle = pAttr->handle - tdxInfoAttrTbl[0].handle;
    //PRINT("write gatt handle:%08x\r\n",gatt_handle);
	if(global_DEVICE_STATUS.fisVaildDevice == Is_No){
		if((gatt_handle == TDXINFO_SEND_PHONE_ID) || (gatt_handle == TDXINFO_SEND_AES_IV)
			||(gatt_handle == TDXINFO_SEND_DATA) || (gatt_handle == TDXINFO_NOTITY_SEND_END) || (gatt_handle == TDXINFO_OTA_INFO)
			|| (gatt_handle == TDXINFO_SEND_PRE_SAVE) || (gatt_handle == TDXINFO_SEND_CLEAN)){
			//PRINT("invaild device cannot use handle:%08x\r\n",gatt_handle);
			return ( ATT_ERR_INSUFFICIENT_AUTHOR );
		}
	}
#if TDX_SMALL_STREAM_ENABLE
    if((gatt_handle == TDXINFO_SEND_AES_IV || gatt_handle == TDXINFO_SEND_PHONE_ID ||
        gatt_handle == TDXINFO_SEND_DATA) && !s_small_stream_trace_logged) {
        s_small_stream_trace_logged = 1;
        BOOT_LOG_HEX8("S h=", gatt_handle);
        BOOT_LOG_HEX32("S l=", len);
        BOOT_LOG_HEX8("S a=", TIS_Active());
        BOOT_LOG_HEX8("S b=", TdxInfo_DisplayBusy());
    }
    if(TIS_Locked() && (gatt_handle == TDXINFO_SEND_PRE_SAVE ||
       gatt_handle == TDXINFO_SEND_CLEAN || gatt_handle == TDXINFO_OTA_INFO ||
       gatt_handle == TDXINFO_NOTITY_SEND_END || gatt_handle == TDXINFO_SWITCH_MODE)) return ATT_ERR_INSUFFICIENT_RESOURCES;
    if((TIS_Active() || TdxInfo_DisplayBusy()) &&
       (gatt_handle == TDXINFO_SEND_AES_IV || gatt_handle == TDXINFO_SEND_PHONE_ID)) {
        if(s_image_session_mode == TDX_IMAGE_SMALL_STREAM && !s_small_stream_gate_logged) {
            s_small_stream_gate_logged = 1;
            BOOT_LOG_HEX8("S gateA=", TIS_Active());
            BOOT_LOG_HEX8("S gateB=", TdxInfo_DisplayBusy());
        }
        return ATT_ERR_INSUFFICIENT_RESOURCES;
    }
#endif
    switch (gatt_handle) {
		case TDXINFO_GET_DATA:
        case TDXINFO_NOTITY_SEND_RESULT_INFO:
		case TDXINFO_NOTITY_SAVE_STATUS:
        case 14: {//19
				//PRINT("WriteAttrCB TDXINFO_GET_DATA TDXINFO_NOTITY_ERROR_INFO TDXINFO_NOTITY_SEND_RESULT_INFO TDXINFO_NOTITY_SAVE_STATUS connHandle=%x\r\n",connHandle);	
				//hex_dump(pValue, len);
                status = GATTServApp_ProcessCCCWriteReq( connHandle, pAttr, pValue, len,
                         offset, GATT_CLIENT_CFG_NOTIFY );
            }
            break;
		case TDXINFO_SEND_PHONE_ID:
			//PRINT("send phone id\r\n");			
			//hex_dump(pValue, len);
			global_DEVICE_STATUS.fSystemTimeOut = 0;
		    rle_reverse_decrypt(pValue, len, DataCallBack);
			break;
		case TDXINFO_SEND_AES_IV:
			//PRINT("WriteAttrCB TDXINFO_SEND_AES_IV\r\n");
			u8IsFirstPackage = TDX_DATA_FIRST;
#if TDX_SMALL_STREAM_ENABLE
            s_small_stream_aborted = 0;
            s_small_stream_gate_logged = 0;
            s_small_stream_trace_logged = 0;
            BOOT_LOG_TEXT("S iv-ready\r\n");
#endif
			//hex_dump(pValue, len);
			memcpy(global_TDX_AES_INFO.szAesIv,pValue,len);
			break;
		case TDXINFO_SEND_DATA:
			{
				//Print_I3("decrypt_ecb data:\n");
	   			//hex_dump(pValue, len);

				if(s_tdx_display_busy_protect && s_tdx_busy_drop_packets > 0){
					s_tdx_busy_drop_packets--;
					if(s_tdx_busy_drop_packets == 0){
						u8IsFirstPackage = TDX_DATA_FIRST;
					}
					IP_RxExit(0); return (SUCCESS);
				}
				#if TDX_SMALL_STREAM_ENABLE
                if(s_small_stream_aborted){
                    return (SUCCESS);
                }
				#endif
	   		
