tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
                UINT32 perf_prepare, perf_header;
                if(!s_tdx_display_busy_protect)
                    IP_RxEnter(u8IsFirstPackage == TDX_DATA_FIRST, len);
                perf_prepare = IP_Start(IsDecryptFlag == Is_Yes ? IP_AES : IP_COPY);
                unsigned int decrypted_len;
			    unsigned char *decrypted;
				if(IsDecryptFlag == Is_Yes)
				{
					//Print_I3("ENCRYPTED YES YES YES YES YES");
					decrypted = decrypt_ecb(pValue, len, &decrypted_len, data_aes_key);
                    IP_Toc(IP_AES, perf_prepare);
				}
				else
				{
					//Print_I3("ENCRYPTED NO NO NO NO NO NO");
					decrypted = (unsigned char *)malloc(len * sizeof(uint8_t));
					decrypted_len = len;
					if(decrypted) memcpy(decrypted, pValue, len);
                    IP_Toc(IP_COPY, perf_prepare);
				}
			    if (!decrypted) {
			    	free(decrypted);
			        Print_I3("decrypt_ecb failure\n");
                    FAULT_LOG_TEXT("FAULT img decrypt\r\n");
                IP_RxExit(1); return (ATT_ERR_INSUFFICIENT_AUTHOR);
			    } 		
				//PRINT("WriteAttrCB TDXINFO_SEND_DATA aaaaaaaaaaaaaaaa decrypted_len=%d\r\n",decrypted_len);
				//hex_dump(decrypted, decrypted_len);
				if(u8IsFirstPackage == TDX_DATA_FIRST){
                    perf_header = IP_Start(IP_HEADER);
					if(decrypted_len != 15){
                        /* Diagnose a rejected first packet without entering the image path. */
#if TDX_SMALL_STREAM_ENABLE
                        s_small_stream_aborted = 1;
#endif
                        BOOT_LOG_TEXT("IMG SW=V24\r\n");
                        BOOT_LOG_HEX32("IMG FH raw=", len);
                        BOOT_LOG_HEX32("IMG FH dec=", decrypted_len);
                        BOOT_LOG_HEX32("IMG FH off=", offset);
                        BOOT_LOG_HEX8("IMG FH enc=", IsDecryptFlag);
                        BOOT_LOG_HEX8("IMG FH b0=", decrypted_len ? decrypted[0] : 0);
                        BOOT_LOG_HEX8("IMG FH b1=", decrypted_len > 1 ? decrypted[1] : 0);
                        BOOT_LOG_HEX8("IMG FH b11=", decrypted_len > 11 ? decrypted[11] : 0);
                        BOOT_LOG_HEX8("IMG FH p15=", decrypted_len > 15 ? decrypted[15] : 0);
                        free(decrypted); IP_RxExit(1); return (ATT_ERR_INVALID_VALUE_SIZE);
                    }
					if(s_tdx_display_busy_protect){
						uint8_t busy_screen_type = decrypted[1];
						uint8_t notify_buf[6];
						uint16_t notify_len = 0;
						uint8_t notify_retry;

						s_tdx_busy_drop_packets = (decrypted[2] << 24) | (decrypted[3] << 16) | (decrypted[4] << 8) | decrypted[5];
						FAULT_LOG_TEXT("FAULT img busy-protect\r\n");
						FAULT_LOG_HEX32("FAULT img busy-drop=", s_tdx_busy_drop_packets);
						u8IsFirstPackage = (s_tdx_busy_drop_packets == 0) ? TDX_DATA_FIRST : TDX_DATA_FIRST_COLOR;
						notitySendEnd(connHandle, 0x03, busy_screen_type, notify_buf, &notify_len);
						for(notify_retry = 0; notify_retry < 3; notify_retry++){
							PRINT("TDX send notify 0x03 repeat %d/3\r\n", notify_retry + 1);
							notitySendFunc(connHandle, notify_buf, &notify_len);
							if(notify_retry < 2){
								delay_ms(50);
							}
						}
						free(decrypted);
						IP_RxExit(0); return (SUCCESS);
					}

					//PRINT("WriteAttrCB TDXINFO_SEND_DATA aaaaaaaaaaaaaaaa decrypted_len=%d\r\n",decrypted_len);
					//hex_dump(decrypted, decrypted_len);
					global_TDX_AES_DATA_INFO.fOpType = decrypted[0];
					global_TDX_AES_DATA_INFO.fScreenType = decrypted[1];
					if(global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_IMG_A || global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_SAVE_IMG_A 
						|| global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_IMG_DIFF_A)
						global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_A;
					if(global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_IMG_B || global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_SAVE_IMG_B 
						|| global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_IMG_DIFF_B)
						global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_B;
					if(global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_IMG_AB || global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_SAVE_IMG_AB)
						global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_AB;
					global_TDX_AES_DATA_INFO.fPackageNum = (decrypted[2] << 24) | (decrypted[3] << 16) | (decrypted[4] << 8) | decrypted[5];
                    if(decrypted[11] != 1){ FAULT_LOG_TEXT("FAULT img protocol\r\n"); free(decrypted); IP_RxExit(1); return (ATT_ERR_INVALID_VALUE); }
                    if(global_TDX_AES_DATA_INFO.fPackageNum == 0){ FAULT_LOG_TEXT("FAULT img package-zero\r\n"); free(decrypted); IP_RxExit(1); return (ATT_ERR_INVALID_VALUE); }
					
					// 处理user_id和lock标志（decrypted[6-9]=user_id, decrypted[14]=lock）
					uint32_t received_user_id = (decrypted[6] << 24) | (decrypted[7] << 16) | (decrypted[8] << 8) | decrypted[9];
					uint8_t user_id_lock = decrypted[14];
					global_TDX_AES_DATA_INFO.fUserId = received_user_id;
					
					if(processUserIdAndLock(received_user_id, user_id_lock) != 0){
						FAULT_LOG_TEXT("FAULT img device-bound\r\n");
						// user_id验证失败，设备已被其他用户绑定，通知前端
						u8IsFirstPackage = TDX_DATA_FIRST_COLOR;//第二个包就不进来了
						notifyDeviceBound(connHandle);
                        IP_Stop(1);
						free(decrypted);
						IP_RxExit(0); return (SUCCESS);  // 返回成功，避免前端重试，通过notify告知真实状态
					}
					
					global_TDX_AES_DATA_INFO.fIsSecret = decrypted[10];
					global_TDX_AES_DATA_INFO.fIsZip = decrypted[11];
					global_TDX_AES_DATA_INFO.fRoomNum= decrypted[12];
					global_TDX_AES_DATA_INFO.fGroupNum= decrypted[13];
					global_DEVICE_STATUS.fBoardCastGroup = global_TDX_AES_DATA_INFO.fGroupNum;
					global_DEVICE_STATUS.fBoardCastRoom = global_TDX_AES_DATA_INFO.fRoomNum;

#if TDX_SMALL_STREAM_ENABLE
                    s_image_session_mode = g_tdx_image_transfer_mode;
                    BOOT_LOG_TEXT("IMG SW=V41\r\n");
                    BOOT_LOG_HEX8("IMG MODE=", s_image_session_mode);
                    if(s_image_session_mode == TDX_IMAGE_SMALL_STREAM) {
                        s_small_stream_aborted = 0;
                        /* Stream format is direct SPD1657 pixels, not save/diff commands. */
                        if(global_TDX_AES_DATA_INFO.fOpType != DEVICE_OP_COMMON ||
                           global_TDX_AES_DATA_INFO.fScreenType > OP_TYPE_IMG_AB ||
                           TIS_Begin(connHandle, global_TDX_AES_DATA_INFO.fScreenType,
                                     global_DEVICE_STATUS.fScreenType,
                                     global_TDX_AES_DATA_INFO.fPackageNum)) {
                            s_small_stream_aborted = 1;
                            free(decrypted); IP_RxExit(1); return ATT_ERR_INVALID_VALUE;
                        }
                        clearBoardcastData();
                    } else if(s_image_session_mode == TDX_IMAGE_LARGE_FLASH) {
                        TIS_UseLarge();
#endif
					if(InitFirstPackage(connHandle) == -1){
						FAULT_LOG_TEXT("FAULT img init-first\r\n");
						free(decrypted);
						IP_RxExit(1); return (ATT_ERR_INSUFFICIENT_AUTHOR);
					}
                    s_zlib_image_aborted = 0;
#if TDX_STORE_ZLIB
                    if(zlib_image_store_begin(global_EXTERN_FLASH_INFO.fImageIndex) != 0){
#else
                    if(zlib_image_codec_begin(zlib_flash_sink, NULL) != 0){
#endif
                        TRANSFER_LOG_TEXT("ZLIB begin failed\r\n");
                        zlib_receive_fail(connHandle); free(decrypted);
                        IP_RxExit(1); return (ATT_ERR_INSUFFICIENT_AUTHOR);
                    }
                    s_zlib_image_active = 1;
					#if !TDX_STORE_ZLIB
                    TRANSFER_LOG_TEXT("ZLIB begin\r\n");
#endif
					#if TDX_STORE_ZLIB
#else
                    IMAGE_LOG_TEXT("IMG zlib session begin\r\n");
#endif
#if TDX_SMALL_STREAM_ENABLE
                    } else { free(decrypted); IP_RxExit(1); return ATT_ERR_INVALID_VALUE; }
#endif
					u8IsFirstPackage = TDX_DATA_FIRST_COLOR;
                    IP_Toc(IP_HEADER, perf_header);
				}else{
#if TDX_SMALL_STREAM_ENABLE
                    if(s_image_session_mode == TDX_IMAGE_SMALL_STREAM) {
                        if(decrypted_len > 65535U || TIS_Push(decrypted, (UINT16)decrypted_len)) {
                            s_small_stream_aborted = 1;
                            free(decrypted); IP_RxExit(1); return ATT_ERR_INVALID_VALUE;
                        }
                    } else
#endif
                    if(InitOtherPackage(connHandle, decrypted, decrypted_len) != 0){ free(decrypted); IP_RxExit(1); return (ATT_ERR_INVALID_VALUE); }
				}
				free(decrypted);
                IP_RxExit(0);
			}
			break;
		case TDXINFO_NOTITY_SEND_END:
			//PRINT("WriteAttrCB TDXINFO_NOTITY_SEND_END\r\n");
			//hex_dump(pValue, len);
			//uint8_t finish_data[] = {0};
			//ble_send_tdxInfo(connHandle,finish_data,1,TDXINFO_NOTITY_SEND_RESULT_INFO-1, tdxInfoBind_cccd) ;
			//tmos_set_event(main_task_ID,EVENT_Low_Power);
			break;
		case TDXINFO_OTA_INFO:
            TIS_UseLarge();
			global_DEVICE_STATUS.fisOtaed = 1;
			//PRINT("WriteAttrCB TDXINFO_OTA_INFO\r\n");
			//hex_dump(pValue, len);
			Rec_OTA_Data(pValue,len);
			break;
		case TDXINFO_SEND_PRE_SAVE:
            TIS_UseLarge();
			global_DEVICE_STATUS.fInitDriver = Is_Yes;
			global_TDX_AES_DATA_INFO.fOpType = OP_TYPE_SAVE_IMG_A;
			global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
			global_DEVICE_STATUS.fRefreshType = DEVICE_OP_COMMON_PRESAVE;
			global_DEVICE_STATUS.fIsNeedStandby = 1;
			PRINT("send pre save len:%d\r\n",len);			
			hex_dump(pValue, len);
			if(pValue[0] == 0x0b){ //pre save
				if(pValue[3] == 0x0a){
					global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_A;
				}
				if(pValue[3] == 0x0b){
					global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_B;
				}
				if(pValue[3] == 0x0c){
					global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_AB;
					global_TDX_AES_DATA_INFO.fOpType = OP_TYPE_SAVE_IMG_AB;
				}
				
				clearBoardcastData();
				InitFlashDriver();
				mDelayuS(50);
				if(preSaveDisplayColor(pValue[2], pValue[1], DEVICE_PRE_SAVE) == -1){
					PRINT("send pre save  error \r\n");	
					uint8_t finish_data1[] = {1};
					ble_send_tdxInfo(connHandle,finish_data1,1,TDXINFO_SEND_PRE_SAVE, tdxInfoPreSave_cccd) ;
					global_DEVICE_STATUS.fWorked =Is_No;
					tmos_start_task(main_task_ID,EVENT_Low_Power ,500);
				}
				else{
					// 预存刷屏成功，标记成功（在EVENT_Low_Power统一保存）
					global_DEVICE_STATUS.fDataSendSuccess = Is_Yes;
				}
				mDelayuS(50);
				DeInitFlashDriver();
			}
			if(pValue[0] == 0x0c){ //clean
				if(len == 1){
					PRINT("send pre clean all\r\n");
					//global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_AB;
					initPicSave(SCREEN_CLEAN_ALL,0xff,0xff);
				}
				else if(len == 2){
					PRINT("send pre clean all room:%d\r\n",pValue[1]);
					initPicSave(SCREEN_CLEAN_ROOM,pValue[1],0xff);
				}else if(len == 3){
					PRINT("send pre clean all room:%d group:%d\r\n",pValue[1],pValue[2]);
					initPicSave(SCREEN_CLEAN_ROOM_AND_GROUP,pValue[1],pValue[2]);
				}
				global_DEVICE_STATUS.fWorked =Is_No;
				tmos_start_task(main_task_ID,EVENT_Low_Power ,500);
			}
			break;
		case TDXINFO_SEND_CLEAN:
            TIS_UseLarge();
			PRINT("send pre clean\r\n");	
			hex_dump(pValue, len);
			global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_AB;
			global_DEVICE_STATUS.fInitDriver = Is_Yes;
			global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
			global_DEVICE_STATUS.fIsNeedStandby = 1;
			preSaveDisplayColor(0, 0, DEVICE_CLEAN_SCREEN);
			break;

