tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
		case TDXINFO_SWITCH_MODE:
			PRINT("WriteAttrCB TDXINFO_SWITCH_MODE len:%d pValue=%d\r\n",len,pValue[0]);
			uint8_t modePrefix[4] = {'M', 'O', 'D', 'E'};    
			uint8_t epdaPrefix[4] = {'E', 'P', 'D', 'A'};
			uint8_t otpPrefix[3] = {'O', 'T', 'P'};
			uint8_t keyPrefix[3] = {'K', 'E', 'Y'};
			uint8_t timePrefix[4] = {'T', 'I', 'M', 'E'};

			if (memcmp(pValue, modePrefix, 4) == 0) {
				// 默认user_id为0（兼容旧指令）
				uint32_t received_user_id = 0x00000000;	
				unsigned char workmode[WORKMODE_Len] = {0x01};
			
				// 如果数据长度包含user_id（>=9字节），提取user_id
				if(len >= 9){
					// 提取user_id（pValue[5-8]，4字节，大端序）
					received_user_id = (pValue[5] << 24) | (pValue[6] << 16) | (pValue[7] << 8) | pValue[8];
				}
				
				// 验证user_id（新旧指令都需要验证）
				if(verifyUserId(received_user_id) != 0){
					PRINT("MODE command rejected: user_id verification failed\r\n");
					workmode[0] = 2; //2为设备已被绑定
					//return ( SUCCESS );  // 返回成功，避免前端重试，通过notify告知真实状态
				}
				else
				{

					//hex_dump(pValue, len);
					if(pValue[4] == DEVICE_MODE_LOW){
						workmode[0] = DEVICE_MODE_LOW;
						P_scanModeRspData(DEVICE_MODE_LOW);
					}
					else{
						workmode[0] = DEVICE_MODE_HIGH;
						P_scanModeRspData(DEVICE_MODE_HIGH);
					}
					Save_EEPROM_Flag(workmode,WORKMODE_Position,WORKMODE_Len);

				}			
				uint8_t finish_data1[5] = {0};
				finish_data1[0] = 'M';
				finish_data1[1] = 'O';
				finish_data1[2] = 'D';
				finish_data1[3] = 'E';
				finish_data1[4] = workmode[0];
				ble_send_tdxInfo(connHandle,finish_data1,5,TDXINFO_GET_DATA-1, tdxInfoGet_cccd) ;
			}
			else if (memcmp(pValue, epdaPrefix, 4) == 0){
				uint8_t finish_data[14] = {0};
				uint32_t received_user_id = 0x00000000;	
				//hex_dump(pValue, len);
				// 如果数据长度包含user_id（>=8字节），提取user_id
				if(len >= 8){
					// 提取user_id（pValue[5-8]，4字节，大端序）
					received_user_id = (pValue[4] << 24) | (pValue[5] << 16) | (pValue[6] << 8) | pValue[7];
				}
				
				// 验证user_id（新旧指令都需要验证）
				if(verifyUserId(received_user_id) != 0){
					PRINT("MODE command rejected: user_id verification failed\r\n");
					finish_data[0] = 'E';
					finish_data[1] = 'P';
					finish_data[2] = 'D';
					finish_data[3] = 'A';
					finish_data[13] = 2;
					//return ( SUCCESS );  // 返回成功，避免前端重试，通过notify告知真实状态
				}
				else
				{
					uint8_t mode[] = {0};
					Get_EEPROM_Flag(mode,WORKMODE_Position,WORKMODE_Len);
				
					finish_data[0] = 'E';
					finish_data[1] = 'P';
					finish_data[2] = 'D';
					finish_data[3] = 'A';
					finish_data[4] = gVerM;
					finish_data[5] = gVerS;
					finish_data[6] = mode[0];
					finish_data[7] = ADC();
					finish_data[8] = gScreenType;
					finish_data[9] = INK_SCREEN_CUSTOMER;
					finish_data[10] = INK_SCREEN_CHIP;
					finish_data[11] = INK_DEVICE_CHIP;
					uint32_t stored_user_id = getUserId();//是否有锁 1为上锁
					if(stored_user_id == 0x00000000 || stored_user_id == 0xFFFFFFFF){
						finish_data[12] = 0;
					}else{
						finish_data[12] = 1;
					}
					finish_data[13] = 0;
				}
				ble_send_tdxInfo(connHandle,finish_data,14,TDXINFO_GET_DATA-1, tdxInfoGet_cccd) ;
			}
			else if (memcmp(pValue, otpPrefix, 3) == 0){
				uint8_t ret_write;
				PRINT("Burn key.......\r\n");
#ifdef ENABLE_BOARD_ENCRYPT
				if(pValue[3] == 'F'){
					ret_write = write_key_to_epprom(pValue+4, Is_Yes);
				}else{
					ret_write = write_key_to_epprom(pValue+4, Is_No);
				}
				uint8_t finish_data2[4] = {0};
		
				finish_data2[0] = 'O';
				finish_data2[1] = 'T';
				finish_data2[2] = 'P';
				finish_data2[3] = ret_write;
				ble_send_tdxInfo(connHandle,finish_data2,4,TDXINFO_GET_DATA-1, tdxInfoGet_cccd) ;
#endif
			}
			else if (memcmp(pValue, keyPrefix, 3) == 0){
				//PRINT("aes key.......\r\n");
				IsDecryptFlag = Is_Yes;
                BOOT_LOG_TEXT("S key-ready\r\n");
				memcpy(data_aes_key, pValue+3, len-3);
				//hex_dump(data_aes_key, len-3);
				reverseData(data_aes_key, len-3);
				//PRINT("aes key 11.......\r\n");
				//hex_dump(data_aes_key, len-3);
			}
		else if (memcmp(pValue, timePrefix, 4) == 0){
			// TIME指令格式：T, I, M, E, 开关（共5个字节）
			// 第5个字节(pValue[4])：开关标志，0x00=关闭，0x01=开启
			// 注意：小时数已写死在代码中（REFRESH_TIMER_FIXED_HOURS），不再通过命令传递
			hex_dump(pValue, len);
			if(len >= 5){
				uint8_t new_enable = pValue[4]; // 获取开关标志

				PRINT("Received TIME command: enable=%d (fixed hours=%d)\r\n", new_enable, REFRESH_TIMER_FIXED_HOURS);

				// 只允许 TIME 命令修改 enabled，其余字段保持flash里原值
				if(new_enable == 0x00 || new_enable == 0x01){
					saveLastRefreshInfo(
						SAVE_KEEP_U8,  // type keep
						SAVE_KEEP_U8,  // group keep
						SAVE_KEEP_U8,  // room keep
						SAVE_KEEP_U8,  // screen_mode keep
						SAVE_KEEP_U8,  // zip keep
						new_enable,    // enabled set
						SAVE_KEEP_U8   // screen_cleared keep
					);
					PRINT("TIME config saved to flash: enable=%d (fixed hours=%d, take effect after reboot)\r\n",
						  new_enable, REFRESH_TIMER_FIXED_HOURS);
				}else{
					PRINT("Invalid enable flag: 0x%02X (should be 0x00 or 0x01)\r\n", new_enable);
				}
			}
			else{
				PRINT("TIME command length error: received %d bytes, expected 5\r\n", len);
			}
		}
			mDelaymS(100);
			global_DEVICE_STATUS.fWorked=Is_No;
			//tmos_start_task(main_task_ID,EVENT_Low_Power ,500);		
			tmos_start_task(main_task_ID,EVENT_Check_TimeOut,500);
			break;

        default:
			PRINT("other ..........\r\n");
            hex_dump(pValue, len);
		    //rle_test();
            break;
    }
    return ( status );
} 

static bStatus_t ble_notify_info( uint16 connHandle, attHandleValueNoti_t *pNoti, uint8 id, gattCharCfg_t *tdxInfo_cccd)
{
    uint16 value = GATTServApp_ReadCharCfg( connHandle, tdxInfo_cccd );
    // If notifications enabled
    if ( value & GATT_CLIENT_CFG_NOTIFY )
    {
        // Set the handle
        pNoti->handle = tdxInfoAttrTbl[id].handle;

        // Send the Indication
        return GATT_Notification( connHandle, pNoti, FALSE);
    }
    return bleIncorrectMode;
}

bStatus_t ble_send_tdxInfo( uint16_t connHandle, uint8_t *data, uint16_t length, uint8_t id,  gattCharCfg_t *tdxInfo_cccd) {
    attHandleValueNoti_t notify_pram;
    uint8_t result = 0;
    notify_pram.len = length;
    notify_pram.pValue = GATT_bm_alloc( connHandle, ATT_HANDLE_VALUE_NOTI, length, NULL, 0 );
    if(notify_pram.pValue != NULL){
        tmos_memcpy( notify_pram.pValue, data, length );
        result = ble_notify_info( connHandle, &notify_pram, id, tdxInfo_cccd);
        if(result != 0 ) {
            GATT_bm_free( (gattMsg_t *)&notify_pram, ATT_HANDLE_VALUE_NOTI );
        }
        return result;
    }
    return bleNoResources;
}

#ifdef OLD_ADVERTDATA
#define DEFAULT_DESIRED_MIN_CONN_INTERVAL     6//320
#define DEFAULT_DESIRED_MIN_CONN_INTERVAL_v2  6//320 // (80)     // �ӿ������ٶ�
#define DEFAULT_DESIRED_MAX_CONN_INTERVAL     100//320
#define DEFAULT_DESIRED_MAX_CONN_INTERVAL_v2  100//320     // �ӿ������ٶ�

static uint8 scanRspData[] = {
    // complete name
 	3+1, // length of this data
    GAP_ADTYPE_LOCAL_NAME_COMPLETE,
    
	'T', '%', '!',
    // connection interval range
    0x05, // length of this data
    GAP_ADTYPE_SLAVE_CONN_INTERVAL_RANGE,
    LO_UINT16(DEFAULT_DESIRED_MIN_CONN_INTERVAL), // 100ms
    HI_UINT16(DEFAULT_DESIRED_MIN_CONN_INTERVAL),
    LO_UINT16(DEFAULT_DESIRED_MAX_CONN_INTERVAL), // 1s
    HI_UINT16(DEFAULT_DESIRED_MAX_CONN_INTERVAL),

    // Tx power level
    0x02, // length of this data
    GAP_ADTYPE_POWER_LEVEL,
    0, // 0dBm
    
  	0x0D,                             // length of this data including the data type byte
	GAP_ADTYPE_MANUFACTURER_SPECIFIC, // manufacturer specific advertisement data type
	'b', 'l', 'e', '1', '2', '3', '4', '5', '6', 
	'7', '0', '0'//, '0', '0', // m_ver s_ver work_mode

