tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
};

static uint8_t advertData[] = {
    // Flags; this sets the device to use limited discoverable
    // mode (advertises for 30 seconds at a time) instead of general
    // discoverable mode (advertises indefinitely)
    0x02, // length of this data
    GAP_ADTYPE_FLAGS,
    GAP_ADTYPE_FLAGS_GENERAL | GAP_ADTYPE_FLAGS_BREDR_NOT_SUPPORTED,

    // service UUID, to notify central devices what services are included
    // in this peripheral
    0x03,                  // length of this data
    GAP_ADTYPE_16BIT_MORE, // some of the UUID's, but not all
    LO_UINT16(SIMPLEPROFILE_SERV_UUID),
    HI_UINT16(SIMPLEPROFILE_SERV_UUID)
};
#else
//boardcast data
static uint8 scanRspData[] = {
	// complete name
	23, 
	GAP_ADTYPE_LOCAL_NAME_COMPLETE,
	'T',
	'%',
	'2','F','7','8','2','D','4','A','A','D','F','A','S','1','F','@','@','A','E','0'
};

static uint8_t advertData[] = {
    0x02, // length of this data
    GAP_ADTYPE_FLAGS,
    GAP_ADTYPE_FLAGS_GENERAL | GAP_ADTYPE_FLAGS_BREDR_NOT_SUPPORTED,

    // service UUID, to notify central devices what services are included
    // in this peripheral
    17,                  // length of this data
    GAP_ADTYPE_128BIT_MORE, // some of the UUID's, but not all
    0x41,0x59,0x8b,0x7b,0x99,0x74,0x07,0xa3,0xc1,0x49,0x13,0x44,0x00,0xff,0x12,0x6b
};
#endif

void intBoardCastData()
{
	unsigned char szVerInfo[VERINFO_Len];
	char char1;
    char char2;
	unsigned char bond1[2];
	Get_EEPROM_Flag(bond1,WORKMODE_Position,WORKMODE_Len);
	
	//Print_I3("@@intBoardCastData mac=%x %x %x %x %x %x \n",Mac[0],Mac[1],Mac[2],Mac[3],Mac[4],Mac[5]);
#ifdef OLD_ADVERTDATA
	scanRspData[27-12] = 0;
    scanRspData[28-12] = 0;
    scanRspData[29-12] = 33 + (global_DEVICE_STATUS.fAdcValue / 2);
	scanRspData[30-12] = Mac[0];
    scanRspData[31-12] = Mac[1];
    scanRspData[32-12] = Mac[2];
    scanRspData[33-12] = Mac[3];
    scanRspData[34-12] = Mac[4];
    scanRspData[35-12] = Mac[5];

	convert_number(VER, &char1, &char2);
	Print_I3("Peripheral_Init %d -> '%c', '%c'\n", VER, char1, char2);
	scanRspData[36-12] = char1;
	scanRspData[37-12] = char2;
#else
	scanRspData[3] = EPD_GetScreenType();
	scanRspData[4] = hexToChar((Mac[5] & 0xf0) >> 4);
	scanRspData[5] = hexToChar(Mac[5] & 0x0f);
	scanRspData[6] = hexToChar((Mac[4] & 0xf0) >> 4);
	scanRspData[7] = hexToChar(Mac[4] & 0x0f);
	scanRspData[8] = hexToChar((Mac[3] & 0xf0) >> 4);
	scanRspData[9] = hexToChar(Mac[3] & 0x0f);
	scanRspData[10] = hexToChar((Mac[2] & 0xf0) >> 4);
	scanRspData[11] = hexToChar(Mac[2] & 0x0f);
	scanRspData[12] = hexToChar((Mac[1] & 0xf0) >> 4);
	scanRspData[13] = hexToChar(Mac[1] & 0x0f);
	scanRspData[14] = hexToChar((Mac[0] & 0xf0) >> 4);
	scanRspData[15] = hexToChar(Mac[0] & 0x0f);
	scanRspData[16] = 33 + (global_DEVICE_STATUS.fAdcValue / 2);

	convert_number(VER, &char1, &char2);
	Print_I3("Peripheral_Init %d -> '%c', '%c'\n", VER, char1, char2);
	scanRspData[17] = char1;
	scanRspData[18] = char2;

	scanRspData[19] = (0x20) |									// ǰ3λ�̶�010�������ƣ�����Ӧ0x20
		((INK_DEVICE_CHIP & 0x01) << 4) |						// bit4��INK_DEVICE_CHIP��0��1����4λ��
		(INK_SCREEN_CHIP & 0x0F);								// ��4λ��INK_SCREEN_CHIP��0~3��ȷ��������4λ��

	scanRspData[20] = getAdcAndWorkMode(Is_No, bond1[0]);
	if(global_DEVICE_STATUS.fisVaildDevice == Is_Yes){
		scanRspData[21] = 'A';
	}else{
		scanRspData[21] = 'B';
	}
	scanRspData[22] = 'E';
	uint32_t stored_user_id = getUserId();//是否有锁
	if(stored_user_id == 0x00000000 || stored_user_id == 0xFFFFFFFF){
		scanRspData[23] = '0';
	}else{
		scanRspData[23] = '1';
	}
#endif

	gVerM = scanRspData[17];
	gVerS = scanRspData[18];
	gScreenType = scanRspData[2];

	Get_EEPROM_Flag(szVerInfo,VERINFO_Position,VERINFO_Len);
	//hex_dump(szVerInfo, VERINFO_Len);
	if((szVerInfo[0] != char1) || (szVerInfo[1] != char2)){
		Print_I3("@@@@@@@@@@@@@@@@@ diff ver need  factory \n");
		extern void initPicSave(int type, int room, int group);
		initPicSave(SCREEN_CLEAN_ALL,0xff,0xff);
		szVerInfo[0] = char1;
		szVerInfo[1] = char2;
		Save_EEPROM_Flag(szVerInfo,VERINFO_Position,VERINFO_Len);	
	}

	// Setup the GAP Peripheral Role Profile
    {
        uint8_t  initial_advertising_enable = TRUE;                                                 //�����㲥ʹ��
        // Set the GAP Role Parameters                                                              //����GAP�����
        GAPRole_SetParameter(GAPROLE_ADVERT_ENABLED, sizeof(uint8_t), &initial_advertising_enable);
        GAPRole_SetParameter(GAPROLE_SCAN_RSP_DATA, sizeof(scanRspData), scanRspData);
        GAPRole_SetParameter(GAPROLE_ADVERT_DATA, sizeof(advertData), advertData);
    }
}

void  P_scanBondRspData(UINT8 bond_status)
{
	printf("P_scanRspData 111 bond_status :%d\r\n",bond_status);
#if 0
	if(bond_status == DEVICE_BONDED)
		scanRspData[3] = '(';
	else
		scanRspData[3] = ')';
	
    GAPRole_SetParameter(GAPROLE_SCAN_RSP_DATA, sizeof(scanRspData), scanRspData);// �������
#endif
}

void  P_scanModeRspData(UINT8 work_status)
{
	printf("P_scanRspData 111 work_status :%d\r\n",work_status);

	if(work_status == DEVICE_MODE_HIGH)
		scanRspData[20] = 'P';
	else
		scanRspData[20] = '@';
	scanRspData[20] = getAdcAndWorkMode(global_DEVICE_STATUS.fIsCharg,work_status);
    GAPRole_SetParameter(GAPROLE_SCAN_RSP_DATA, sizeof(scanRspData), scanRspData);// �������
}

void  P_scanAdcRspData(UINT8 work_status)
{
	//printf("P_scanRspData 111 fAdcValue :%d\r\n",global_DEVICE_STATUS.fAdcValue);
	scanRspData[16] = 33 + (global_DEVICE_STATUS.fAdcValue / 2);//pre num  start '!'
	
    GAPRole_SetParameter(GAPROLE_SCAN_RSP_DATA, sizeof(scanRspData), scanRspData);// �������
}

void  P_scanPreNumRspData(UINT8 pre_num)
{
#if 0
	printf("P_scanPreNumRspData 111 pre_num :%d\r\n",pre_num);
	scanRspData[21] = '!' + pre_num;   //pre num  start '!'
	
    GAPRole_SetParameter(GAPROLE_SCAN_RSP_DATA, sizeof(scanRspData), scanRspData);// �������
#endif
}

void  P_scanIsChargeRspData()
{
	//printf("P_scanIsChargeRspData 00000000000000000000000\r\n");
	unsigned char mode1[2];
	Get_EEPROM_Flag(mode1,WORKMODE_Position,WORKMODE_Len);

	scanRspData[20] = getAdcAndWorkMode(global_DEVICE_STATUS.fIsCharg, mode1[0]);
    GAPRole_SetParameter(GAPROLE_SCAN_RSP_DATA, sizeof(scanRspData), scanRspData);
}

