tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
static uint8_t firstAdvertisementData[BOARDCAST_Len];  // �洢�״ι㲥���ݵĻ�����
static uint8_t firstAdvertisementLen[BOARDLEN_Len];

void receiveGapBroadcastAdData(UINT8 *adData, UINT32 dataLen)
{
    if(TIS_Locked() || TIS_HoldPower()) return;
	if((adData[0] == BROADCAST_COMMAND_PRESAVE && adData[1] == BROADCAST_PREFIX_CHAR2 && adData[2] == BROADCAST_PREFIX_CHAR3 && adData[3] == BROADCAST_PREFIX_CHAR4) || 
		(adData[0] == BROADCAST_COMMAND_CLEAN_SCREEN && adData[1] == BROADCAST_PREFIX_CHAR2 && adData[2] == BROADCAST_PREFIX_CHAR3 && adData[3] == BROADCAST_PREFIX_CHAR4) ||
		(adData[0] == BROADCAST_COMMAND_CLEAN_PRESAVE && adData[1] == BROADCAST_PREFIX_CHAR2 && adData[2] == BROADCAST_PREFIX_CHAR3 && adData[3] == BROADCAST_PREFIX_CHAR4)){
		Print_I3("	boardcast data: %.*s\n", dataLen, adData);
		
		// ��ӡ�豸��ַ��RSSI
		/*Print_I3("find device: ");
		for (i = 0; i < B_ADDR_LEN; i++) {
			Print_I3("%02X", pEvent->deviceInfo.addr[i]);
			if (i < B_ADDR_LEN - 1) PRINT(":");
		}
		Print_I3(", RSSI: %d dBm\n", pEvent->deviceInfo.rssi);*/
		// 如果设备即将重启，不处理新的广播数据，避免误保存
        if(global_DEVICE_STATUS.fWillReboot == Is_Yes){
            Print_I3("    Device will reboot, ignore new broadcast\n");
            return;
        }
		if(global_DEVICE_STATUS.fWorked == Is_No){
			if((adData[1]==BROADCAST_PREFIX_CHAR2) && (adData[2]==BROADCAST_PREFIX_CHAR3) && (adData[3]==BROADCAST_PREFIX_CHAR4)){
				Get_EEPROM_Flag(firstAdvertisementData,BOARDCAST_Position,BOARDCAST_Len);
				Get_EEPROM_Flag(firstAdvertisementLen,BOARDLEN_Position,BOARDLEN_Len);
				if((firstAdvertisementLen[0] != dataLen) || (memcmp(adData, firstAdvertisementData, dataLen) != 0)){
					uint8_t room_num = 0;
					uint8_t group_num = 0;
					uint8_t screen_mode_char = 0;
					int param_count = 0;
					
					// 验证user_id并解析广播参数
					if(verifyBroadcastAndParseParams(adData, dataLen, &room_num, &group_num, &screen_mode_char, &param_count) != 0){
						// 验证失败或解析失败，直接返回
						return;
					}
					memcpy(firstAdvertisementData, adData, dataLen);
					firstAdvertisementLen[0] = dataLen;
					Save_EEPROM_Flag(firstAdvertisementData,BOARDCAST_Position,BOARDCAST_Len);
					Save_EEPROM_Flag(firstAdvertisementLen,BOARDLEN_Position,BOARDLEN_Len);
					Print_I3("	boardcast data the diff @@@@@@@\n");
					if(adData[0] == BROADCAST_COMMAND_PRESAVE){
						// G命令：预存刷屏（格式：G@!#11C%xxxxx，必须是3位参数）
						if(param_count != 3){
							PRINT("G command requires 3 params (room+group+mode)\n");
							return;
						}
						global_DEVICE_STATUS.fBoardCastType = SCREEN_PRESAVE_OP;
						// 解析屏幕模式（第三位字符）
						if(screen_mode_char == 'a'){
							global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_A;
						}else if(screen_mode_char == 'b'){
							global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_B;
						}else if(screen_mode_char == 'C'){
							global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_AB;
						}else{
							PRINT("Invalid screen mode: %c\n", screen_mode_char);
							return;
						}
						global_DEVICE_STATUS.fBoardCastRoom = room_num;
						global_DEVICE_STATUS.fBoardCastGroup = group_num;
					}else if(adData[0] == BROADCAST_COMMAND_CLEAN_SCREEN){
						// C命令：清屏（支持0/1/2位参数）
						if(param_count == 0){
							// 没有room/group参数，清空所有（格式：C@!#%xxxxx）
							global_DEVICE_STATUS.fBoardCastType = SCREEN_CLEAN_SCRREN_ALL;
						}else if(param_count == 1){
							// 只有room参数（格式：C@!#1%xxxxx）
							global_DEVICE_STATUS.fBoardCastType = SCREEN_CLEAN_SCRREN_ROOM;
							global_DEVICE_STATUS.fBoardCastRoom = room_num;
						}else if(param_count == 2 || param_count == 3){//3是兼容旧协议
							// 有room和group参数（格式：C@!#12%xxxxx）
							global_DEVICE_STATUS.fBoardCastType = SCREEN_CLEAN_SCRREN_ROOM;
							global_DEVICE_STATUS.fBoardCastRoom = room_num;
							global_DEVICE_STATUS.fBoardCastGroup = group_num;
						}else{
							PRINT("C command invalid param count: %d\n", param_count);
							return;
						}
					}else if(adData[0] == BROADCAST_COMMAND_CLEAN_PRESAVE){
						// D命令：清预存（支持0/1/2位参数）
						if(param_count == 0){
							// 没有room/group参数，清空所有（格式：D@!#%xxxxx）
							global_DEVICE_STATUS.fBoardCastType = SCREEN_CLEAN_ALL;
						}else if(param_count == 1){
							// 只有room参数（格式：D@!#1%xxxxx）
							global_DEVICE_STATUS.fBoardCastType = SCREEN_CLEAN_ROOM;
							global_DEVICE_STATUS.fBoardCastRoom = room_num;
						}else if(param_count == 2){
							// 有room和group参数（格式：D@!#12%xxxxx）
							global_DEVICE_STATUS.fBoardCastType = SCREEN_CLEAN_ROOM_AND_GROUP;
							global_DEVICE_STATUS.fBoardCastRoom = room_num;
							global_DEVICE_STATUS.fBoardCastGroup = group_num;
						}else{
							PRINT("D command invalid param count: %d\n", param_count);
							return;
						}
					}
	
					//Print_I3("boardcast info type:%d room:%d group:%d ab:%d",global_DEVICE_STATUS.fBoardCastType,global_BOE_AES_DATA_INFO.fRoomNum,
					//	global_BOE_AES_DATA_INFO.fGroupNum,global_DEVICE_STATUS.fScreenType);
					tmos_start_task(main_task_ID,EVENT_Boardcast_Op ,200);
				}else{
					Print_I3("	boardcast data the same @@@@@@@\n");
				}
			}
		}
	}
}

void processGapBroadcastAdData(){
    if(TIS_Locked() || TIS_HoldPower()) return;
    TIS_UseLarge();
	//PRINT("boardcast info type:%d room:%d group:%d ab:%d\r\n",global_DEVICE_STATUS.fBoardCastType,global_DEVICE_STATUS.fBoardCastRoom,
	//	global_DEVICE_STATUS.fBoardCastGroup,global_DEVICE_STATUS.fScreenType);

	if(global_DEVICE_STATUS.fBoardCastType == SCREEN_PRESAVE_OP){
		global_DEVICE_STATUS.fInitDriver = Is_Yes;
		//global_BOE_AES_DATA_INFO.fOpType = OP_TYPE_SAVE_IMG_A;
		global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
		global_DEVICE_STATUS.fRefreshType = DEVICE_OP_PRESAVE;
		global_DEVICE_STATUS.fIsNeedStandby = 1;
		InitFlashDriver();
		mDelayuS(50);

		if(preSaveDisplayColor(global_DEVICE_STATUS.fBoardCastRoom, global_DEVICE_STATUS.fBoardCastGroup, DEVICE_PRE_SAVE) == -1){
			PRINT("send pre save 11  error \r\n");	
			global_DEVICE_STATUS.fWorked =Is_No;
		}
		else{
			// 蓝牙广播切换预存刷屏成功，标记成功（在EVENT_Low_Power统一保存）
			int Room, Group;
			Group = global_DEVICE_STATUS.fBoardCastRoom; //预存切换协议里的group和room是反着的，所以要反过来保存
			Room = global_DEVICE_STATUS.fBoardCastGroup;
			global_DEVICE_STATUS.fBoardCastRoom = Room;
			global_DEVICE_STATUS.fBoardCastGroup = Group;
			global_DEVICE_STATUS.fDataSendSuccess = Is_Yes;
		}
		mDelayuS(50);
		DeInitFlashDriver();
	}

	if(global_DEVICE_STATUS.fBoardCastType == SCREEN_CLEAN_ALL){
		initPicSave(SCREEN_CLEAN_ALL,0xff,0xff);
		global_DEVICE_STATUS.fWorked =Is_No;
	}

