tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
	if(global_DEVICE_STATUS.fBoardCastType == SCREEN_CLEAN_ROOM){
		cleanPresaveScreen(SCREEN_CLEAN_ROOM,global_DEVICE_STATUS.fBoardCastRoom,0xff);
		initPicSave(SCREEN_CLEAN_ROOM,global_DEVICE_STATUS.fBoardCastRoom,0xff);
	}

	if(global_DEVICE_STATUS.fBoardCastType == SCREEN_CLEAN_ROOM_AND_GROUP){
		cleanPresaveScreen(SCREEN_CLEAN_ROOM_AND_GROUP,global_DEVICE_STATUS.fBoardCastRoom,global_DEVICE_STATUS.fBoardCastGroup);
		initPicSave(SCREEN_CLEAN_ROOM_AND_GROUP,global_DEVICE_STATUS.fBoardCastRoom,global_DEVICE_STATUS.fBoardCastGroup);
	}

	if(global_DEVICE_STATUS.fBoardCastType == SCREEN_CLEAN_SCRREN_ALL){
		cleanPresaveScreen(SCREEN_CLEAN_SCRREN_ALL,0,0);
	}

	if(global_DEVICE_STATUS.fBoardCastType == SCREEN_CLEAN_SCRREN_ROOM){
		cleanPresaveScreen(SCREEN_CLEAN_SCRREN_ROOM,global_DEVICE_STATUS.fBoardCastRoom,0xff);
	}

	tmos_start_task(main_task_ID,EVENT_Low_Power ,500);
}

void TdxInfo_ClearDisplayBusyProtect(void)
{
    TIS_RefreshComplete();
	if(s_large_refresh_log_started) {
		BOOT_LOG_TEXT("S refresh-done\r\n");
		s_large_refresh_log_pending = 0;
		s_large_refresh_log_started = 0;
	}
	s_tdx_display_busy_protect = 0;
	s_tdx_busy_drop_packets = 0;
	u8IsFirstPackage = TDX_DATA_FIRST;
	s_zlib_image_active = 0;
#if TDX_STORE_ZLIB
	zlib_image_store_abort();
#endif
}

int getPresaveImageIndex(uint16 connHandle){
	int ret;
	
	ret = EraseSaveBlock(connHandle,global_TDX_AES_DATA_INFO.fGroupNum,global_TDX_AES_DATA_INFO.fRoomNum,
#if TDX_STORE_ZLIB
        IMAGE_FLASH_ZLIB
#else
        0
#endif
    );
	if(ret == -1){
		PRINT("WriteAttrCB TDXINFO_SEND_DATA error 00000000000000000000000000000\r\n");
		uint8_t finish_data[] = {10};
		ble_send_tdxInfo(connHandle,finish_data,1,TDXINFO_NOTITY_SEND_RESULT_INFO-1, tdxInfoBind_cccd) ;
		global_DEVICE_STATUS.fWorked =Is_No;
		tmos_start_task(main_task_ID,EVENT_Low_Power ,500);
		return -1;
	}
	return ret;
}

int InitFirstPackage(uint16 connHandle){
	s_refresh_notify_rx_valid = 0;
	s_refresh_notify_trace = 0;
	s_large_refresh_log_pending = 0;
	global_DEVICE_STATUS.fInitDriver = Is_Yes;
	global_DEVICE_STATUS.fPackageCnt = 0;
	global_DEVICE_STATUS.fDataSendSuccess = Is_No;
	global_DEVICE_STATUS.fOtaStatus = RTN_OTA_COMMON;
	global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
	global_EXTERN_FLASH_INFO.fImageIndex = 0;
	#if TDX_STORE_ZLIB
    global_EXTERN_FLASH_INFO.fZip = IMAGE_FLASH_ZLIB;
#else
    global_EXTERN_FLASH_INFO.fZip = 0;
#endif
	global_DEVICE_STATUS.fRefreshType = global_TDX_AES_DATA_INFO.fOpType;
	global_DEVICE_STATUS.fPackageCount = global_TDX_AES_DATA_INFO.fPackageNum;
	global_DEVICE_STATUS.fIsNeedStandby = 0;
	global_DEVICE_STATUS.fImageDataLen = 0;
	
	InitFlashDriver();
	if(global_TDX_AES_DATA_INFO.fOpType == DEVICE_OP_COMMON){	
		if(global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_IMG_DIFF_B){
			global_EXTERN_FLASH_INFO.fImageIndex =SCREEN_A_COMMON_INDEX;//SCREEN_B_COMMON_INDEX;
		}
		else{
			global_EXTERN_FLASH_INFO.fImageIndex =SCREEN_B_COMMON_INDEX;//SCREEN_A_COMMON_INDEX;
		}
		// When writing a common image into a shared slot, also save that slot zip so later timed refresh can read it per side
		#if TDX_STORE_ZLIB
        /* An erased/missing commit header must fail closed after reboot. */
        saveCommonImageZip(global_EXTERN_FLASH_INFO.fImageIndex, IMAGE_FLASH_ZLIB);
#endif
	}else{
		int image_index = getPresaveImageIndex(connHandle);
        if(image_index < 0) return -1;
        global_EXTERN_FLASH_INFO.fImageIndex = image_index;
	}

	clearBoardcastData();
	PRINT("TDX INFO DATA:\r\n");
	PRINT("global_TDX_AES_DATA_INFO.fOpType:%d\r\n",global_TDX_AES_DATA_INFO.fOpType);
	PRINT("global_TDX_AES_DATA_INFO.fScreenType:%d\r\n",global_TDX_AES_DATA_INFO.fScreenType);
	PRINT("global_TDX_AES_DATA_INFO.fPackageNum:%d\r\n",global_TDX_AES_DATA_INFO.fPackageNum);
	PRINT("global_TDX_AES_DATA_INFO.fUserId:0x%08X\r\n", global_TDX_AES_DATA_INFO.fUserId);
	PRINT("global_TDX_AES_DATA_INFO.fIsSecret:%d\r\n",global_TDX_AES_DATA_INFO.fIsSecret);
	PRINT("global_TDX_AES_DATA_INFO.fIsZip:%d\r\n",global_TDX_AES_DATA_INFO.fIsZip);
	PRINT("global_TDX_AES_DATA_INFO.fRoomNum:%d\r\n",global_TDX_AES_DATA_INFO.fRoomNum);
	PRINT("global_TDX_AES_DATA_INFO.fGroupNum:%d\r\n",global_TDX_AES_DATA_INFO.fGroupNum);
	PRINT("TDX INFO DATA END\r\n");

	return 0;
}

int InitOtherPackage(uint16 connHandle, UINT8 *adData, UINT32 dataLen)
{
    int result;
    UINT32 perf_commit;
    if(global_DEVICE_STATUS.fPackageCnt + 1U == global_TDX_AES_DATA_INFO.fPackageNum &&
       global_TDX_AES_DATA_INFO.fScreenType != OP_TYPE_IMG_DIFF_A) {
        s_refresh_notify_rx_ticks = RTC_GetCycle32k();
        s_refresh_notify_rx_valid = 1;
    }
    IP_ZipBytes((UINT16)dataLen);
#if TDX_STORE_ZLIB
    result = s_zlib_image_active ? zlib_image_store_feed(adData, (UINT16)dataLen) : -1;
#else
    result = s_zlib_image_active ? zlib_image_codec_feed(adData, (UINT16)dataLen) : -1;
#endif
    if(result != 0) {
        FAULT_LOG_TEXT("FAULT img feed/store\r\n");
        zlib_receive_fail(connHandle);
        return -1;
    }
    global_DEVICE_STATUS.fPackageCnt++;
    if(global_DEVICE_STATUS.fPackageCnt != global_TDX_AES_DATA_INFO.fPackageNum) {
        if(global_DEVICE_STATUS.fPackageCnt > global_TDX_AES_DATA_INFO.fPackageNum) {
            FAULT_LOG_TEXT("FAULT img package-overflow\r\n");
            zlib_receive_fail(connHandle);
            return -1;
        }
        return 0;
    }
    IP_RxDone();
    perf_commit = IP_Start(IP_COMMIT);
#if TDX_STORE_ZLIB
    result = zlib_image_store_finish();
#else
    result = zlib_image_codec_finish();
#endif
    if(result != 0) {
        FAULT_LOG_TEXT("FAULT img finish/store\r\n");
        zlib_receive_fail(connHandle);
        return -1;
    }
    s_zlib_image_aborted = 0;
    global_DEVICE_STATUS.fPackageCnt = 0;
    global_DEVICE_STATUS.fPackageCount = 1;
#if TDX_STORE_ZLIB
    global_EXTERN_FLASH_INFO.fZip = IMAGE_FLASH_ZLIB;
    if(global_TDX_AES_DATA_INFO.fOpType != DEVICE_OP_COMMON)
        CommitZlibSaveBlock(global_EXTERN_FLASH_INFO.fImageIndex);
#else
    Save256DataToFlash(NULL, 0, global_EXTERN_FLASH_INFO.fImageIndex, global_EXTERN_FLASH_INFO.fBlockNum);
    global_EXTERN_FLASH_INFO.fZip = 0;
    if(global_TDX_AES_DATA_INFO.fOpType == DEVICE_OP_COMMON)
        saveCommonImageZip(global_EXTERN_FLASH_INFO.fImageIndex, 0);
#endif
    s_zlib_image_active = 0;
    u8IsFirstPackage = TDX_DATA_FIRST;
    IsDecryptFlag = Is_No;
    global_DEVICE_STATUS.fRefreshType = global_TDX_AES_DATA_INFO.fOpType;
    DeInitFlashDriver();
    global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
    global_DEVICE_STATUS.fDataSendSuccess = Is_Yes;
    IP_Toc(IP_COMMIT, perf_commit);
    if(global_TDX_AES_DATA_INFO.fScreenType != OP_TYPE_IMG_DIFF_A) {
        uint8_t notify_buf[6];
        uint16_t notify_len = 0;
        UINT32 perf_notify = IP_Start(IP_NOTIFY);

        /* Large-file success means the complete image is committed to Flash.
         * Notify now; the EPD replay remains queued and protected below. */
		s_tdx_display_busy_protect = 1;
		s_tdx_busy_drop_packets = 0;
		s_large_refresh_log_pending = 1;
        /* DeInitFlashDriver leaves Flash powered; avoid another 200 ms init. */
        global_DEVICE_STATUS.fImageType = (global_TDX_AES_DATA_INFO.fScreenType == OP_TYPE_IMG_DIFF_B) ? 1 : 0;
        IP_Queue();
        tmos_start_task(main_task_ID, EVENT_Get_Battle_Charge, 100);
        notitySendEnd(connHandle, 0x01, global_TDX_AES_DATA_INFO.fScreenType,
                      notify_buf, &notify_len);
        if(s_refresh_notify_rx_valid)
            BOOT_LOG_HEX32("N ms=", refresh_notify_elapsed_ms());
        s_refresh_notify_trace = 1;
        notitySendFunc(connHandle, notify_buf, &notify_len);
        s_refresh_notify_trace = 0;
        s_refresh_notify_rx_valid = 0;
        IP_Toc(IP_NOTIFY, perf_notify);
    } else {
        uint8_t notify_buf[6];
        uint16_t notify_len = 0;
        UINT32 perf_notify = IP_Start(IP_NOTIFY);
        /* A different-image A packet is only stored.  The APP needs this ACK
         * before it can send B, so it cannot wait for a refresh command. */
        notitySendEnd(connHandle, 0x01, global_TDX_AES_DATA_INFO.fScreenType, notify_buf, &notify_len);
        notitySendFunc(connHandle, notify_buf, &notify_len);
        IP_Toc(IP_NOTIFY, perf_notify);
        IP_Stop(4); /* Stored A side; its later replay is a separate pass. */
    }
    return 0;
}
void notitySendEnd(uint16 connHandle, uint8 status, uint8 type, uint8_t *out_buf, uint16_t *out_len)
{
#if(INK_SCREEN_CUSTOMER != INK_SCREEN_CUSTOMER_TY)
	uint8_t notify_code = 'A';

	if((type == OP_TYPE_IMG_B) || (type == OP_TYPE_SAVE_IMG_B) || (type == OP_TYPE_IMG_DIFF_B)){
		notify_code = 'B';
	}
	else if((type == OP_TYPE_IMG_A) || (type == OP_TYPE_SAVE_IMG_A) || (type == OP_TYPE_IMG_DIFF_A)
		|| (type == OP_TYPE_IMG_AB) || (type == OP_TYPE_SAVE_IMG_AB)){
		notify_code = 'A';
	}
	else{
		notify_code = (global_DEVICE_STATUS.fScreenType == SCREEN_TYPE_IMG_B) ? 'B' : 'A';
	}

	*out_len = 6;

	out_buf[0] = 'C';
	out_buf[1] = 'O';
	out_buf[2] = 'D';
	out_buf[3] = 'E';
	out_buf[4] = notify_code;
    out_buf[5] = status;
#else
	*out_len = 1;

