tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/Profile/tdxinfoservice.c
	out_buf[0] = status;
#endif
}

void notitySendFunc(uint16 connHandle, uint8_t *out_buf, uint16_t *out_len)
{
	// 修复：带重试机制的notify发送，避免应用层收不到消息
	bStatus_t send_ret;
	uint8_t send_retry = 0;
	uint8_t send_attempts = 0;
	const uint8_t SEND_MAX_RETRY = 3;

	if (out_len == NULL) {
        return;
    }
	
	do {
		send_attempts++;
		send_ret = ble_send_tdxInfo(connHandle, out_buf, *out_len, TDXINFO_NOTITY_SEND_RESULT_INFO-1, tdxInfoBind_cccd);
		if (send_ret == SUCCESS) {
			PRINT("Notify send success on attempt %d\r\n", send_retry + 1);
			break;  // 发送成功，退出重试
		}
		else if (send_ret == blePending || send_ret == bleNoResources || send_ret == bleTimeout) {
			PRINT("Notify pending/busy (0x%02x), retry %d/%d\r\n", send_ret, send_retry + 1, SEND_MAX_RETRY);
			mDelayuS(5000);  // 延时5ms等待BLE栈处理
		}
		else if (send_ret == bleNotConnected) {
			PRINT("BLE not connected, stop retry\r\n");
			break;  // 连接断开，停止重试
		}
		else {
			PRINT("Notify failed with error 0x%02x\r\n", send_ret);
		}
		send_retry++;
	} while (send_retry < SEND_MAX_RETRY);

	if (send_ret != SUCCESS) {
		PRINT("WARNING: Notify failed after %d attempts, error=0x%02x\r\n", send_retry, send_ret);
	}
	if(s_refresh_notify_trace) {
		BOOT_LOG_HEX8("N rc=", send_ret);
		BOOT_LOG_HEX8("N try=", send_attempts);
	}
}

void TdxInfo_ArmRefreshNotify(uint16 connHandle, uint8 type, uint8 refresh_count)
{
    s_refresh_notify_conn = connHandle;
    s_refresh_notify_type = type;
    s_refresh_notify_count = refresh_count ? refresh_count : 1;
    s_refresh_notify_pending = 1;
    BOOT_LOG_HEX8("N arm=", s_refresh_notify_count);
}

void TdxInfo_RefreshCommandIssued(void)
{
    uint8_t notify_buf[6];
    uint16_t notify_len = 0;
    UINT32 perf_notify;

    if(s_large_refresh_log_pending) {
        s_large_refresh_log_pending = 0;
        s_large_refresh_log_started = 1;
        BOOT_LOG_TEXT("S refresh-start\r\n");
    }

    if(!s_refresh_notify_pending) return;
    if(s_refresh_notify_count > 1) {
        s_refresh_notify_count--;
        return;
    }

    /* Clear first so another display call cannot duplicate this transaction. */
    s_refresh_notify_pending = 0;
    s_refresh_notify_count = 0;
    perf_notify = IP_Start(IP_NOTIFY);
    notitySendEnd(s_refresh_notify_conn, 0x01, s_refresh_notify_type,
                  notify_buf, &notify_len);
    if(s_refresh_notify_rx_valid)
        BOOT_LOG_HEX32("N ms=", refresh_notify_elapsed_ms());
    s_refresh_notify_trace = 1;
    notitySendFunc(s_refresh_notify_conn, notify_buf, &notify_len);
    s_refresh_notify_trace = 0;
    s_refresh_notify_rx_valid = 0;
    IP_Toc(IP_NOTIFY, perf_notify);
}

void TdxInfo_CancelRefreshNotify(void)
{
    s_refresh_notify_pending = 0;
    s_refresh_notify_count = 0;
	s_refresh_notify_trace = 0;
	s_refresh_notify_rx_valid = 0;
	s_large_refresh_log_pending = 0;
}

/*********************************************************************
 * @fn      notifyDeviceBound
 *
 * @brief   通知前端设备已被其他用户绑定（状态码0x02）
 *
 * @param   connHandle - 连接句柄
 *
 * @return  none
 */
void notifyDeviceBound(uint16 connHandle)
{
	uint8_t notify_buf[6];
	uint16_t notify_len = 0;
	uint8_t notify_retry;
	
	PRINT("Notify device bound to another user (status=0x02)\r\n");
	
	// 使用0x02状态码表示设备已被绑定（0x01=成功, 0x02=已绑定）
	notitySendEnd(connHandle, 0x02, global_TDX_AES_DATA_INFO.fScreenType, notify_buf, &notify_len);
	
	for(notify_retry = 0; notify_retry < 3; notify_retry++){
		PRINT("TDX send notify 0x02 repeat %d/3\r\n", notify_retry + 1);
		notitySendFunc(connHandle, notify_buf, &notify_len);
		if(notify_retry < 2){
			delay_ms(50);
		}
	}
}
#endif
/*********************************************************************
*********************************************************************/

#if TDX_SMALL_STREAM_ENABLE
UINT8 TdxInfo_DisplayBusy(void) { return s_tdx_display_busy_protect; }
void TdxInfo_StreamResult(UINT16 conn, UINT8 type, UINT8 error)
{
    UINT8 notify_buf[6];
    UINT16 notify_len = 0;
    u8IsFirstPackage = TDX_DATA_FIRST;
    IsDecryptFlag = Is_No;
    global_DEVICE_STATUS.fPackageCnt = 0;
    global_DEVICE_STATUS.fPackageCount = 1;
    s_zlib_image_active = 0;
    if(!error) {
        s_tdx_display_busy_protect = 1;
        s_tdx_busy_drop_packets = 0;
        BOOT_LOG_TEXT("S refresh-start\r\n");
        s_small_stream_trace_logged = 0;
    }
    if(error == 0xff) {
        TdxInfo_CancelRefreshNotify();
        return; /* Link is gone; reset state without notification. */
    }
    if(!error) return; /* Success was sent immediately after the EPD refresh command. */
    TdxInfo_CancelRefreshNotify();
    notitySendEnd(conn, error ? 0x04 : 0x01, type, notify_buf, &notify_len);
    notitySendFunc(conn, notify_buf, &notify_len);
}
#endif
